update mermaid chart
